#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

module.ecs.random_string.instance_name[0]: Refreshing state... [id=PDjUjG]
module.network.volcengine_eip_address.foo: Refreshing state... [id=eip-rs32p28kb9q8v0x57wmqx49]
module.network.volcengine_vpc.foo: Refreshing state... [id=vpc-miod81gibw8w5smt1b2da0vy]
module.network.volcengine_security_group.foo: Refreshing state... [id=sg-rs32qnggkv0gv0x58qscgir]
module.network.volcengine_subnet.foo: Refreshing state... [id=subnet-rs32u7pgwfeov0x57h4s0by]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.volcengine_ecs_instance.foo will be created
  + resource "volcengine_ecs_instance" "foo" {
      + cpus                          = (known after apply)
      + created_at                    = (known after apply)
      + deployment_set_id             = (known after apply)
      + description                   = "Managed by Terraform"
      + gpu_devices                   = (known after apply)
      + host_name                     = (known after apply)
      + id                            = (known after apply)
      + image_id                      = "image-ybqi99s7yq8rx7mnk44b"
      + instance_charge_type          = "PostPaid"
      + instance_id                   = (known after apply)
      + instance_name                 = "tf-test-ecs--PDjUjG"
      + instance_type                 = "ecs.g3i.xlarge"
      + ipv6_address_count            = (known after apply)
      + ipv6_addresses                = (known after apply)
      + is_gpu                        = (known after apply)
      + key_pair_id                   = (known after apply)
      + memory_size                   = (known after apply)
      + network_interface_id          = (known after apply)
      + os_name                       = (known after apply)
      + os_type                       = (known after apply)
      + password                      = (sensitive value)
      + primary_ip_address            = (known after apply)
      + project_name                  = "default"
      + security_enhancement_strategy = "Active"
      + security_group_ids            = [
          + "sg-rs32qnggkv0gv0x58qscgir",
        ]
      + spot_strategy                 = (known after apply)
      + status                        = (known after apply)
      + stopped_mode                  = (known after apply)
      + subnet_id                     = "subnet-rs32u7pgwfeov0x57h4s0by"
      + system_volume_id              = (known after apply)
      + system_volume_size            = 40
      + system_volume_type            = "ESSD_PL0"
      + updated_at                    = (known after apply)
      + user_data                     = (known after apply)
      + vpc_id                        = (known after apply)
      + zone_id                       = (known after apply)

      + cpu_options (known after apply)

      + data_volumes (known after apply)

      + secondary_network_interfaces (known after apply)
    }

  # module.ecs.volcengine_eip_associate.foo[0] will be created
  + resource "volcengine_eip_associate" "foo" {
      + allocation_id      = "eip-rs32p28kb9q8v0x57wmqx49"
      + id                 = (known after apply)
      + instance_id        = (known after apply)
      + instance_type      = "EcsInstance"
      + private_ip_address = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @msq177, Action: `pull_request`*